export const loginInputTitle = 'от 3 до 20 символов, латиница, может содержать цифры, но не состоять из них, без пробелов, без спецсимволов (допустимы дефис и нижнее подчёркивание)';

export const passwordInputTitle = 'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра';

export const emailInputTitle = 'латиница, может включать цифры и спецсимволы вроде дефиса, обязательно должна быть «собака» (@) и точка после неё, но перед точкой обязательно должны быть буквы';

export const phoneInputTitle = 'от 10 до 15 символов, состоит из цифр, может начинается с плюса';

export const firstNameAndSecondName = 'латиница или кириллица, первая буква должна быть заглавной, без пробелов и без цифр, нет спецсимволов (допустим только дефис)';
