export const LOGIN_INPUT_TITLE = 'от 3 до 20 символов, латиница, может содержать цифры, но не состоять из них, без пробелов, без спецсимволов (допустимы дефис и нижнее подчёркивание)';

export const PASSWORD_INPUT_TITLE = 'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра';

export const EMAIL_INPUT_TITLE = 'латиница, может включать цифры и спецсимволы вроде дефиса, обязательно должна быть «собака» (@) и точка после неё, но перед точкой обязательно должны быть буквы';

export const PHONE_INPUT_TITLE = 'от 10 до 15 символов, состоит из цифр, может начинается с плюса';

export const FIRST_NAME_AND_SECOND_NAME_INPUT_TITLE = 'латиница или кириллица, первая буква должна быть заглавной, без пробелов и без цифр, нет спецсимволов (допустим только дефис)';

export const DISPLAY_NAME_INPUT_TITLE = 'от 1 до 10 символов, поле не должно быть пустым';